from aiogram import F, Router

router = Router()


@router.callback_query(F.data == 'nitro_full')
async def process_nitro_basic_callback(callback_query):
    text = (
        "🎉 Вы выбрали предложение: Discord Nitro (Full)!\n\n"
        "💎 Особенности Nitro Full:\n"
        "- Доступ ко всем функциям Nitro\n"
        "- Улучшенные эмодзи и аватары\n"
        "- Возможность использования анимированных аватаров\n"
        "- Серверные бусты и эксклюзивные привилегии\n\n"
        "Чтобы оформить подписку, перейдите по [ссылке](https://discord.com/nitro/full)\n\n"
        "Если у вас есть вопросы, не стесняйтесь обращаться!"
    )

    await callback_query.message.edit_text(
        text=text,
        parse_mode='Markdown',
    )
