from aiogram import F, Router
from aiogram.types import InlineKeyboardMarkup, InlineKeyboardButton

router = Router()

keyboard = InlineKeyboardMarkup(inline_keyboard=[
    [InlineKeyboardButton(text='Discord Nitro (Basic)', callback_data='nitro_basic')],
    [InlineKeyboardButton(text='Discord Nitro (Full)', callback_data='nitro_full')],
])


@router.callback_query(F.data == 'nitro_offer')
async def process_nitro_offer_callback(callback_query):
    text = (
        "🎉 Вы выбрали предложение: **Discord Nitro!**\n\n"
        "**❓ Что такое Discord Nitro?**\n"
        "• Discord Nitro — это премиум-подписка для Discord, которая открывает дополнительные функции и возможности для вашего аккаунта.\n\n"
        "**📌 Преимущества Nitro:**\n"
        "- Анимированные эмодзи и возможность использовать их на любом сервере\n"
        "- Увеличенный лимит загрузки файлов до 100 МБ (или 50 МБ для Nitro Classic)\n"
        "- HD-стриминг в Go Live и на серверных каналах\n"
        "- Бонусные бейджи и значки для профиля\n\n"
        "**📌 Разновидности Nitro:**\n"
        "• **Nitro Classic** — базовая подписка с преимуществами эмодзи и загрузки файлов, без HD-стриминга.\n"
        "• **Nitro Full** — полная версия с расширенными функциями, HD-стримингом, увеличенной загрузкой файлов и эксклюзивными бонусами.\n\n"
        "📌 Nitro идеально подходит тем, кто активно использует Discord для общения, стриминга или создает собственные серверы."
    )

    await callback_query.message.edit_text(
        text=text,
        parse_mode='Markdown',
        reply_markup=keyboard,
    )
